app/views/microposts/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id %>
    <%= form.select :user_id,options_from_collection_for_select( User.all, :id,:name,micropost.user_id)%>